In [1]:
import pandas as pd
course_name = ['Data Science', 'Machine Learning', 'Big Data', 'Data Engineer']
duration = [2,3,6,4]
df = pd.DataFrame(data = {'course_name' : course_name, 'duration' : duration})

In [2]:
df

        course_name  duration
0      Data Science         2
1  Machine Learning         3
2          Big Data         6
3     Data Engineer         4

In [3]:
#Q.1
df[['course_name','duration']][1:2]

        course_name  duration
1  Machine Learning         3

In [4]:
#Q.2
Loc and iloc are two functions in Pandas that are used to slice a data set in a Pandas DataFrame.
The function . loc is typically used for label indexing and can access multiple columns, while .
iloc is used for integer indexing.

SyntaxError: invalid syntax (1311838116.py, line 2)

In [5]:
#Q.3
import pandas as pd
import numpy as np
columns = ['column_1', 'column_2', 'column_3', 'column_4', 'column_5', 'column_6']
indices = [1,2,3,4,5,6]
df1 = pd.DataFrame(np.random.rand(6,6), columns = columns, index = indices)

In [6]:
df1

   column_1  column_2  column_3  column_4  column_5  column_6
1  0.351039  0.046375  0.835507  0.103782  0.298676  0.307678
2  0.062399  0.971495  0.214441  0.911892  0.448876  0.637067
3  0.731571  0.833904  0.660984  0.191369  0.387313  0.616620
4  0.939659  0.456801  0.155038  0.657387  0.532181  0.441956
5  0.024567  0.840302  0.685590  0.536992  0.092463  0.123677
6  0.399127  0.597885  0.080367  0.303795  0.756368  0.696028

In [7]:
new_df = df1.reindex([3,0,1,2])

In [8]:
new_df

   column_1  column_2  column_3  column_4  column_5  column_6
3  0.731571  0.833904  0.660984  0.191369  0.387313  0.616620
0       NaN       NaN       NaN       NaN       NaN       NaN
1  0.351039  0.046375  0.835507  0.103782  0.298676  0.307678
2  0.062399  0.971495  0.214441  0.911892  0.448876  0.637067

In [9]:
new_df.loc[2]

column_1    0.062399
column_2    0.971495
column_3    0.214441
column_4    0.911892
column_5    0.448876
column_6    0.637067
Name: 2, dtype: float64

In [10]:
new_df.iloc[2]

column_1    0.351039
column_2    0.046375
column_3    0.835507
column_4    0.103782
column_5    0.298676
column_6    0.307678
Name: 1, dtype: float64

In [11]:
#Q.4
df1

   column_1  column_2  column_3  column_4  column_5  column_6
1  0.351039  0.046375  0.835507  0.103782  0.298676  0.307678
2  0.062399  0.971495  0.214441  0.911892  0.448876  0.637067
3  0.731571  0.833904  0.660984  0.191369  0.387313  0.616620
4  0.939659  0.456801  0.155038  0.657387  0.532181  0.441956
5  0.024567  0.840302  0.685590  0.536992  0.092463  0.123677
6  0.399127  0.597885  0.080367  0.303795  0.756368  0.696028

In [12]:
df1.mean()

column_1    0.418060
column_2    0.624460
column_3    0.438655
column_4    0.450869
column_5    0.419313
column_6    0.470504
dtype: float64

In [13]:
df1[['column_1','column_2']].std()

column_1    0.362363
column_2    0.338788
dtype: float64

In [14]:
#Q.5
df1

   column_1  column_2  column_3  column_4  column_5  column_6
1  0.351039  0.046375  0.835507  0.103782  0.298676  0.307678
2  0.062399  0.971495  0.214441  0.911892  0.448876  0.637067
3  0.731571  0.833904  0.660984  0.191369  0.387313  0.616620
4  0.939659  0.456801  0.155038  0.657387  0.532181  0.441956
5  0.024567  0.840302  0.685590  0.536992  0.092463  0.123677
6  0.399127  0.597885  0.080367  0.303795  0.756368  0.696028

In [15]:
df1.loc[df1["column_1"] == "0.134064", "0.970964"] = 'umesh'

In [16]:
df1

   column_1  column_2  column_3  column_4  column_5  column_6 0.970964
1  0.351039  0.046375  0.835507  0.103782  0.298676  0.307678      NaN
2  0.062399  0.971495  0.214441  0.911892  0.448876  0.637067      NaN
3  0.731571  0.833904  0.660984  0.191369  0.387313  0.616620      NaN
4  0.939659  0.456801  0.155038  0.657387  0.532181  0.441956      NaN
5  0.024567  0.840302  0.685590  0.536992  0.092463  0.123677      NaN
6  0.399127  0.597885  0.080367  0.303795  0.756368  0.696028      NaN

In [17]:
#Q.6
Windows function in Pandas can be broadly divided into three categories namely- Aggregate, Ranking, and Value.
The group by aggregate function can be used to partition and group the entire data frame by some column.
We can specify the column name in the parameter of the pandas.

SyntaxError: invalid syntax (2668184258.py, line 2)

In [18]:
#Q.7
df2 = pd.DataFrame({"date":['2023-04-26','2023-04-25','2023-06-26']})

In [19]:
df2

         date
0  2023-04-26
1  2023-04-25
2  2023-06-26

In [20]:
df2['current_date'] = pd.to_datetime(df2['date'])

In [21]:
df2

         date current_date
0  2023-04-26   2023-04-26
1  2023-04-25   2023-04-25
2  2023-06-26   2023-06-26

In [22]:
df2['year'] = df2['current_date'].dt.year

In [23]:
df2

         date current_date  year
0  2023-04-26   2023-04-26  2023
1  2023-04-25   2023-04-25  2023
2  2023-06-26   2023-06-26  2023

In [24]:
df2['month'] = df2['current_date'].dt.month

In [25]:
df2

         date current_date  year  month
0  2023-04-26   2023-04-26  2023      4
1  2023-04-25   2023-04-25  2023      4
2  2023-06-26   2023-06-26  2023      6

In [26]:
#Q.8
Date = ['2023-04-5','2023-04-5']

In [27]:
Date

['2023-04-5', '2023-04-5']

In [28]:
df3 = pd.DataFrame(Date)

In [29]:
df3

           0
0  2023-04-5
1  2023-04-5

In [41]:
bd =  pd.Timedelta(days = 1, hours = 5,minutes = 45)

In [45]:
dt = pd.to_datetime(Date)

In [46]:
bd

Timedelta('1 days 05:45:00')

In [47]:
dt

DatetimeIndex(['2023-04-05', '2023-04-05'], dtype='datetime64[ns]', freq=None)

In [48]:
bd+dt

DatetimeIndex(['2023-04-06 05:45:00', '2023-04-06 05:45:00'], dtype='datetime64[ns]', freq=None)

In [ ]:
#Q.9